# Brews
brew "wget"
brew "git-crypt"
brew "gh"
brew "shared-mime-info"
brew "postgresql@13"
brew "graphviz"
brew "tmux"
brew "libpq"
brew "reattach-to-user-namespace" # tmux yank
brew "mise"
brew "neovim"

# Ruby dependencies
brew 'openssl@3'
brew 'readline'
brew 'libyaml'
brew 'gmp'
brew 'autoconf'
brew 'rust' # Ruby 3.2 and above requires the Rust compiler if you want to have YJIT enabled

# Go dependencies
brew 'coreutils'

# Elixir/Erlang dependencies
brew 'autoconf'
brew 'wxwidgets'
brew 'libxslt'
brew 'fop'

# Python
brew 'cmake' # had to install cmake to install sentencepiece

# Casks
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'alacritty'
cask 'tableplus'
cask 'visual-studio-code'
cask 'rectangle'
cask 'zoom'
cask 'font-fira-code'
cask 'docker-desktop'
cask 'font-fira-code-nerd-font'

