# Brews
brew "wget"
brew "git-crypt"
brew "rbenv"
brew "gh"
brew "shared-mime-info"
brew "postgresql"
brew "graphviz"
brew "tmux"
brew "docker"

# Casks
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'tableplus'
cask 'visual-studio-code'
