# Brews
brew "wget"
brew "git-crypt"
brew "gh"
brew "shared-mime-info"
brew "postgresql@13"
brew "graphviz"
brew "tmux"
brew "docker"
brew "libpq"
brew "reattach-to-user-namespace" # tmux yank
brew "asdf"
brew "neovim"

# Casks
cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'tableplus'
cask 'visual-studio-code'
cask 'rectangle'
